Revit 2027 API
ParameterTypeId.SpotElevRotateWithComponent Property
 "Rotate with Component"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId SpotElevRotateWithComponent { get; }
Public Shared ReadOnly Property SpotElevRotateWithComponent As ForgeTypeId
	Get
public:
static property ForgeTypeId^ SpotElevRotateWithComponent {
	ForgeTypeId^ get ();
}
static member SpotElevRotateWithComponent : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace